app/controllers/registrations_controller.rb

  def create
    user = User.create!(
      email: params['user']['email'],

      password: params['user']['password'],

      password_confirmation: params['user']['password_confirmation']
    )
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "21129@21129.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-08-02 08:33:16.467905"], ["updated_at", "2022-08-02 08:33:16.467905"]]